/*
1-13
Реализовать класс Формула (интерпретатор). Должна быть возможность работы с
данным классом следующим образом:
 Formula f = new Formula();
 f.prepare("x*x +y");
 double v = f.execute(2, 5.7);
 // и т.п.
*/


public class Main {
    public static void main(String[] args) {
        System.out.println("Hello world!");
    }
}