/*
3-10
Найти минимальное кол-во шагов, за которое шахматная фигура конь может из одной
заданной клетки шахматного поля попасть в другую клетку шахматного поля, а также
последовательность таких шагов (если их несколько, то любую).
Подсказка: Использовать очередь, в которую поместить начальное положение коня.
Далее, пока не попадем в требуемую клетку, извлекаем из очереди клетку, для которой
перебираем все возможные ходы конем (клетки), которые помещаем в очередь. Для
хранения последовательности ходов используем стек или просто массив/список.
*/

public class Main {
    public static void main(String[] args) {
        System.out.println("Hello world!");
    }
}